###################################################################

# Created by write_sdc on Thu Feb 22 18:53:59 2024

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 3.40189 [get_ports ini_MEM_RDY_ins]
set_load -pin_load 3.40189 [get_ports ini_MEM_RDY_mem]
create_clock [get_ports CLK]  -name MY_CLK  -period 5.3  -waveform {0 2.65}
set_clock_uncertainty 0.07  [get_clocks MY_CLK]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports RSTn]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports ini_PROC_REQ_ins]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports ini_PROC_REQ_mem]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports ini_WE_ins]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports ini_WE_mem]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_ADDR_ins[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_ADDR_ins[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_ADDR_ins[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_ADDR_ins[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_ADDR_ins[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_ADDR_ins[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_ADDR_ins[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_ADDR_ins[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_ADDR_ins[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_ADDR_ins[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_ADDR_ins[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_ADDR_ins[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_ADDR_ins[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_ADDR_ins[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_ADDR_ins[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_ADDR_ins[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_ADDR_ins[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_ADDR_ins[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_ADDR_ins[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_ADDR_ins[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_ADDR_ins[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_ADDR_ins[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_ADDR_ins[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_ADDR_ins[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_ADDR_ins[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_ADDR_ins[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_ADDR_ins[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_ADDR_ins[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_ADDR_ins[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_ADDR_ins[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_ADDR_ins[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_ADDR_ins[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_ADDR_mem[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_ADDR_mem[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_ADDR_mem[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_ADDR_mem[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_ADDR_mem[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_ADDR_mem[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_ADDR_mem[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_ADDR_mem[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_ADDR_mem[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_ADDR_mem[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_ADDR_mem[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_ADDR_mem[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_ADDR_mem[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_ADDR_mem[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_ADDR_mem[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_ADDR_mem[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_ADDR_mem[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_ADDR_mem[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_ADDR_mem[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_ADDR_mem[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_ADDR_mem[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_ADDR_mem[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_ADDR_mem[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_ADDR_mem[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_ADDR_mem[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_ADDR_mem[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_ADDR_mem[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_ADDR_mem[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_ADDR_mem[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_ADDR_mem[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_ADDR_mem[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_ADDR_mem[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_WDATA_ins[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_WDATA_ins[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_WDATA_ins[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_WDATA_ins[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_WDATA_ins[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_WDATA_ins[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_WDATA_ins[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_WDATA_ins[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_WDATA_ins[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_WDATA_ins[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_WDATA_ins[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_WDATA_ins[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_WDATA_ins[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_WDATA_ins[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_WDATA_ins[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_WDATA_ins[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_WDATA_ins[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_WDATA_ins[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_WDATA_ins[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_WDATA_ins[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_WDATA_ins[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_WDATA_ins[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_WDATA_ins[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_WDATA_ins[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_WDATA_ins[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_WDATA_ins[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_WDATA_ins[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_WDATA_ins[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_WDATA_ins[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_WDATA_ins[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_WDATA_ins[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_WDATA_ins[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_WDATA_mem[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_WDATA_mem[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_WDATA_mem[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_WDATA_mem[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_WDATA_mem[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_WDATA_mem[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_WDATA_mem[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_WDATA_mem[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_WDATA_mem[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_WDATA_mem[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_WDATA_mem[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_WDATA_mem[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_WDATA_mem[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_WDATA_mem[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_WDATA_mem[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_WDATA_mem[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_WDATA_mem[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_WDATA_mem[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_WDATA_mem[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_WDATA_mem[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_WDATA_mem[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_WDATA_mem[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_WDATA_mem[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_WDATA_mem[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_WDATA_mem[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_WDATA_mem[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_WDATA_mem[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_WDATA_mem[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_WDATA_mem[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_WDATA_mem[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_WDATA_mem[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ini_WDATA_mem[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_addr[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_addr[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_addr[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_addr[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_addr[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_addr[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_addr[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_addr[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_addr[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_addr[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_addr[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_addr[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_addr[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_addr[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_addr[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_addr[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_addr[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_addr[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_addr[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_addr[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_addr[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_addr[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_addr[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_addr[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_addr[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_addr[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_addr[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_addr[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_addr[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_addr[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_addr[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_addr[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_sp[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_sp[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_sp[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_sp[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_sp[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_sp[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_sp[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_sp[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_sp[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_sp[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_sp[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_sp[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_sp[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_sp[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_sp[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_sp[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_sp[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_sp[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_sp[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_sp[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_sp[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_sp[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_sp[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_sp[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_sp[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_sp[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_sp[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_sp[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_sp[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_sp[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_sp[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_sp[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_gp[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_gp[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_gp[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_gp[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_gp[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_gp[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_gp[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_gp[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_gp[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_gp[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_gp[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_gp[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_gp[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_gp[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_gp[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_gp[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_gp[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_gp[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_gp[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_gp[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_gp[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_gp[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_gp[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_gp[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_gp[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_gp[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_gp[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_gp[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_gp[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_gp[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_gp[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_gp[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports ini]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports ini_MEM_RDY_ins]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports ini_MEM_RDY_mem]
