###################################################################

# Created by write_sdc on Thu Feb 22 18:24:17 2024

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 3.40189 [get_ports proc_req_if]
set_load -pin_load 3.40189 [get_ports we_if]
set_load -pin_load 3.40189 [get_ports {addr[31]}]
set_load -pin_load 3.40189 [get_ports {addr[30]}]
set_load -pin_load 3.40189 [get_ports {addr[29]}]
set_load -pin_load 3.40189 [get_ports {addr[28]}]
set_load -pin_load 3.40189 [get_ports {addr[27]}]
set_load -pin_load 3.40189 [get_ports {addr[26]}]
set_load -pin_load 3.40189 [get_ports {addr[25]}]
set_load -pin_load 3.40189 [get_ports {addr[24]}]
set_load -pin_load 3.40189 [get_ports {addr[23]}]
set_load -pin_load 3.40189 [get_ports {addr[22]}]
set_load -pin_load 3.40189 [get_ports {addr[21]}]
set_load -pin_load 3.40189 [get_ports {addr[20]}]
set_load -pin_load 3.40189 [get_ports {addr[19]}]
set_load -pin_load 3.40189 [get_ports {addr[18]}]
set_load -pin_load 3.40189 [get_ports {addr[17]}]
set_load -pin_load 3.40189 [get_ports {addr[16]}]
set_load -pin_load 3.40189 [get_ports {addr[15]}]
set_load -pin_load 3.40189 [get_ports {addr[14]}]
set_load -pin_load 3.40189 [get_ports {addr[13]}]
set_load -pin_load 3.40189 [get_ports {addr[12]}]
set_load -pin_load 3.40189 [get_ports {addr[11]}]
set_load -pin_load 3.40189 [get_ports {addr[10]}]
set_load -pin_load 3.40189 [get_ports {addr[9]}]
set_load -pin_load 3.40189 [get_ports {addr[8]}]
set_load -pin_load 3.40189 [get_ports {addr[7]}]
set_load -pin_load 3.40189 [get_ports {addr[6]}]
set_load -pin_load 3.40189 [get_ports {addr[5]}]
set_load -pin_load 3.40189 [get_ports {addr[4]}]
set_load -pin_load 3.40189 [get_ports {addr[3]}]
set_load -pin_load 3.40189 [get_ports {addr[2]}]
set_load -pin_load 3.40189 [get_ports {addr[1]}]
set_load -pin_load 3.40189 [get_ports {addr[0]}]
set_load -pin_load 3.40189 [get_ports proc_req_mem]
set_load -pin_load 3.40189 [get_ports we_mem]
set_load -pin_load 3.40189 [get_ports {addr_mem[31]}]
set_load -pin_load 3.40189 [get_ports {addr_mem[30]}]
set_load -pin_load 3.40189 [get_ports {addr_mem[29]}]
set_load -pin_load 3.40189 [get_ports {addr_mem[28]}]
set_load -pin_load 3.40189 [get_ports {addr_mem[27]}]
set_load -pin_load 3.40189 [get_ports {addr_mem[26]}]
set_load -pin_load 3.40189 [get_ports {addr_mem[25]}]
set_load -pin_load 3.40189 [get_ports {addr_mem[24]}]
set_load -pin_load 3.40189 [get_ports {addr_mem[23]}]
set_load -pin_load 3.40189 [get_ports {addr_mem[22]}]
set_load -pin_load 3.40189 [get_ports {addr_mem[21]}]
set_load -pin_load 3.40189 [get_ports {addr_mem[20]}]
set_load -pin_load 3.40189 [get_ports {addr_mem[19]}]
set_load -pin_load 3.40189 [get_ports {addr_mem[18]}]
set_load -pin_load 3.40189 [get_ports {addr_mem[17]}]
set_load -pin_load 3.40189 [get_ports {addr_mem[16]}]
set_load -pin_load 3.40189 [get_ports {addr_mem[15]}]
set_load -pin_load 3.40189 [get_ports {addr_mem[14]}]
set_load -pin_load 3.40189 [get_ports {addr_mem[13]}]
set_load -pin_load 3.40189 [get_ports {addr_mem[12]}]
set_load -pin_load 3.40189 [get_ports {addr_mem[11]}]
set_load -pin_load 3.40189 [get_ports {addr_mem[10]}]
set_load -pin_load 3.40189 [get_ports {addr_mem[9]}]
set_load -pin_load 3.40189 [get_ports {addr_mem[8]}]
set_load -pin_load 3.40189 [get_ports {addr_mem[7]}]
set_load -pin_load 3.40189 [get_ports {addr_mem[6]}]
set_load -pin_load 3.40189 [get_ports {addr_mem[5]}]
set_load -pin_load 3.40189 [get_ports {addr_mem[4]}]
set_load -pin_load 3.40189 [get_ports {addr_mem[3]}]
set_load -pin_load 3.40189 [get_ports {addr_mem[2]}]
set_load -pin_load 3.40189 [get_ports {addr_mem[1]}]
set_load -pin_load 3.40189 [get_ports {addr_mem[0]}]
set_load -pin_load 3.40189 [get_ports {wdata_mem[31]}]
set_load -pin_load 3.40189 [get_ports {wdata_mem[30]}]
set_load -pin_load 3.40189 [get_ports {wdata_mem[29]}]
set_load -pin_load 3.40189 [get_ports {wdata_mem[28]}]
set_load -pin_load 3.40189 [get_ports {wdata_mem[27]}]
set_load -pin_load 3.40189 [get_ports {wdata_mem[26]}]
set_load -pin_load 3.40189 [get_ports {wdata_mem[25]}]
set_load -pin_load 3.40189 [get_ports {wdata_mem[24]}]
set_load -pin_load 3.40189 [get_ports {wdata_mem[23]}]
set_load -pin_load 3.40189 [get_ports {wdata_mem[22]}]
set_load -pin_load 3.40189 [get_ports {wdata_mem[21]}]
set_load -pin_load 3.40189 [get_ports {wdata_mem[20]}]
set_load -pin_load 3.40189 [get_ports {wdata_mem[19]}]
set_load -pin_load 3.40189 [get_ports {wdata_mem[18]}]
set_load -pin_load 3.40189 [get_ports {wdata_mem[17]}]
set_load -pin_load 3.40189 [get_ports {wdata_mem[16]}]
set_load -pin_load 3.40189 [get_ports {wdata_mem[15]}]
set_load -pin_load 3.40189 [get_ports {wdata_mem[14]}]
set_load -pin_load 3.40189 [get_ports {wdata_mem[13]}]
set_load -pin_load 3.40189 [get_ports {wdata_mem[12]}]
set_load -pin_load 3.40189 [get_ports {wdata_mem[11]}]
set_load -pin_load 3.40189 [get_ports {wdata_mem[10]}]
set_load -pin_load 3.40189 [get_ports {wdata_mem[9]}]
set_load -pin_load 3.40189 [get_ports {wdata_mem[8]}]
set_load -pin_load 3.40189 [get_ports {wdata_mem[7]}]
set_load -pin_load 3.40189 [get_ports {wdata_mem[6]}]
set_load -pin_load 3.40189 [get_ports {wdata_mem[5]}]
set_load -pin_load 3.40189 [get_ports {wdata_mem[4]}]
set_load -pin_load 3.40189 [get_ports {wdata_mem[3]}]
set_load -pin_load 3.40189 [get_ports {wdata_mem[2]}]
set_load -pin_load 3.40189 [get_ports {wdata_mem[1]}]
set_load -pin_load 3.40189 [get_ports {wdata_mem[0]}]
create_clock [get_ports CLK]  -name MY_CLK  -period 3  -waveform {0 1.5}
set_clock_uncertainty 0.07  [get_clocks MY_CLK]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports RSTn]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_addr[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_addr[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_addr[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_addr[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_addr[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_addr[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_addr[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_addr[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_addr[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_addr[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_addr[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_addr[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_addr[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_addr[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_addr[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_addr[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_addr[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_addr[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_addr[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_addr[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_addr[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_addr[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_addr[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_addr[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_addr[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_addr[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_addr[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_addr[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_addr[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_addr[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_addr[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_addr[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports mem_rdy_if]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports valid_if]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports mem_rdy_mem]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports valid_mem]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rdata_if[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rdata_if[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rdata_if[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rdata_if[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rdata_if[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rdata_if[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rdata_if[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rdata_if[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rdata_if[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rdata_if[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rdata_if[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rdata_if[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rdata_if[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rdata_if[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rdata_if[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rdata_if[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rdata_if[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rdata_if[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rdata_if[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rdata_if[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rdata_if[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rdata_if[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rdata_if[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rdata_if[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rdata_if[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rdata_if[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rdata_if[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rdata_if[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rdata_if[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rdata_if[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rdata_if[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rdata_if[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rdata_mem[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rdata_mem[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rdata_mem[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rdata_mem[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rdata_mem[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rdata_mem[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rdata_mem[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rdata_mem[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rdata_mem[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rdata_mem[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rdata_mem[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rdata_mem[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rdata_mem[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rdata_mem[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rdata_mem[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rdata_mem[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rdata_mem[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rdata_mem[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rdata_mem[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rdata_mem[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rdata_mem[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rdata_mem[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rdata_mem[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rdata_mem[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rdata_mem[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rdata_mem[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rdata_mem[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rdata_mem[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rdata_mem[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rdata_mem[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rdata_mem[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rdata_mem[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_sp[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_sp[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_sp[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_sp[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_sp[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_sp[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_sp[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_sp[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_sp[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_sp[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_sp[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_sp[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_sp[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_sp[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_sp[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_sp[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_sp[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_sp[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_sp[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_sp[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_sp[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_sp[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_sp[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_sp[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_sp[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_sp[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_sp[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_sp[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_sp[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_sp[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_sp[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_sp[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_gp[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_gp[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_gp[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_gp[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_gp[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_gp[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_gp[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_gp[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_gp[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_gp[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_gp[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_gp[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_gp[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_gp[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_gp[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_gp[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_gp[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_gp[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_gp[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_gp[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_gp[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_gp[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_gp[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_gp[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_gp[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_gp[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_gp[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_gp[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_gp[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_gp[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_gp[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {basic_gp[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports proc_req_if]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports we_if]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports proc_req_mem]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports we_mem]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_mem[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_mem[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_mem[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_mem[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_mem[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_mem[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_mem[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_mem[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_mem[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_mem[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_mem[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_mem[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_mem[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_mem[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_mem[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_mem[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_mem[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_mem[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_mem[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_mem[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_mem[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_mem[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_mem[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_mem[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_mem[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_mem[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_mem[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_mem[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_mem[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_mem[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_mem[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_mem[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wdata_mem[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wdata_mem[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wdata_mem[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wdata_mem[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wdata_mem[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wdata_mem[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wdata_mem[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wdata_mem[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wdata_mem[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wdata_mem[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wdata_mem[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wdata_mem[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wdata_mem[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wdata_mem[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wdata_mem[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wdata_mem[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wdata_mem[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wdata_mem[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wdata_mem[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wdata_mem[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wdata_mem[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wdata_mem[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wdata_mem[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wdata_mem[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wdata_mem[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wdata_mem[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wdata_mem[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wdata_mem[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wdata_mem[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wdata_mem[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wdata_mem[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wdata_mem[0]}]
